app/Models/ModelTabungan.php

    public function getAllData()
    {
        return $this->db->table('tbl_tabungan')
            ->join('tbl_nasabah', 'tbl_nasabah.id_nasabah = tbl_tabungan.nasabah_id ', 'left')
            ->orderBy('id_tabungan', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_tabungan`
LEFT JOIN `tbl_nasabah` ON `tbl_nasabah`.`id_nasabah` = `tbl_tabungan`.`nasabah_id`
ORDER BY `id_tabungan` ASC

    public function insertData($data)
    {
        $this->db->table('tbl_tabungan')
            ->insert($data);
---
INSERT INTO `tbl_tabungan` (`nasabah_id`, `nominal_masuk`, `tgl_masuk`) VALUES ('2', '2.000.000', '2023-08-30')

    public function editData($data)
    {
        $this->db->table('tbl_tabungan')
            ->join('tbl_nasabah', 'tbl_nasabah.id_nasabah = tbl_tabungan.nasabah_id ', 'left')
            ->where('id_tabungan', $data['id_tabungan'])
            ->update($data);
---
UPDATE `tbl_tabungan` SET `id_tabungan` = '16', `nominal_masuk` = '3.000.000', `tgl_masuk` = '2023-08-31'
WHERE `id_tabungan` = '16'

    public function detailData($nasabah_id)
    {
        return $this->db->table('tbl_tabungan')
            ->join('tbl_nasabah', 'tbl_nasabah.id_nasabah = tbl_tabungan.nasabah_id ', 'left')
            ->where('nasabah_id', $nasabah_id)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_nasabah`
LEFT JOIN `tbl_tabungan` ON `tbl_nasabah`.`id_nasabah` = `tbl_tabungan`.`nasabah_id`
WHERE `id_nasabah` = '2'
SELECT *
FROM `tbl_tabungan`
LEFT JOIN `tbl_nasabah` ON `tbl_nasabah`.`id_nasabah` = `tbl_tabungan`.`nasabah_id`
WHERE `nasabah_id` = '2'

    public function totalSaldo($nasabah_id)
    {
        return $this->db->table('tbl_tabungan')
            ->selectSum('nominal_masuk')
            ->where('nasabah_id', $nasabah_id)
            ->get()
            ->getRowArray();
---
SELECT SUM(`nominal_masuk`) AS `nominal_masuk`
FROM `tbl_tabungan`
WHERE `nasabah_id` = '2'