app/Models/ModelTransaksiSampah.php

SELECT *
FROM `tbl_transaksi_sampah`
LEFT JOIN `tbl_nasabah` ON `tbl_nasabah`.`id_nasabah` = `tbl_transaksi_sampah`.`nasabah_id`
LEFT JOIN `tbl_jenis_sampah` ON `tbl_jenis_sampah`.`id_jenis_sampah` = `tbl_transaksi_sampah`.`id_jenis_sampah`
ORDER BY `id_transaksi_sampah` ASC
---
    public function getAllData($where = [])
    {
        $query = $this->db->table('tbl_transaksi_sampah')
        ->join('tbl_nasabah', 'tbl_nasabah.id_nasabah = tbl_transaksi_sampah.nasabah_id ', 'left')
        ->join('tbl_jenis_sampah', 'tbl_jenis_sampah.id_jenis_sampah = tbl_transaksi_sampah.id_jenis_sampah ', 'left')
        ->orderBy('id_transaksi_sampah', 'ASC');

INSERT INTO `tbl_transaksi_sampah` (`nasabah_id`, `jenis`, `jumlah`, `id_jenis_sampah`, `created_at`) VALUES ('2', '1', '60000', '1', '2023-09-03 05:02:17')
---
    public function insertData($data)
    {
        $this->db->table('tbl_transaksi_sampah')
            ->insert($data);

SELECT *
FROM `tbl_transaksi_sampah`
LEFT JOIN `tbl_nasabah` ON `tbl_nasabah`.`id_nasabah` = `tbl_transaksi_sampah`.`nasabah_id`
LEFT JOIN `tbl_jenis_sampah` ON `tbl_jenis_sampah`.`id_jenis_sampah` = `tbl_transaksi_sampah`.`id_jenis_sampah`
WHERE `nasabah_id` = '2'
---
    public function detailData($nasabah_id)
    {
        return $this->db->table('tbl_transaksi_sampah')
            ->join('tbl_nasabah', 'tbl_nasabah.id_nasabah = tbl_transaksi_sampah.nasabah_id ', 'left')
            ->join('tbl_jenis_sampah', 'tbl_jenis_sampah.id_jenis_sampah = tbl_transaksi_sampah.id_jenis_sampah ', 'left')
            ->where('nasabah_id', $nasabah_id)
            ->get()
            ->getResultArray();

SELECT SUM(`jumlah`) AS `jumlah`
FROM `tbl_transaksi_sampah`
WHERE `jenis` = '1'
AND `nasabah_id` = '2'
---
    public function totalDebit($nasabah_id)
    {
        return $this->db->table('tbl_transaksi_sampah')
            ->selectSum('jumlah')
            ->where('jenis', '1')
            ->where('nasabah_id', $nasabah_id)
            ->get()
            ->getRowArray();

SELECT SUM(`jumlah`) AS `jumlah`
FROM `tbl_transaksi_sampah`
WHERE `jenis` = '2'
AND `nasabah_id` = '2'
---
    public function totalKredit($nasabah_id)
    {
        return $this->db->table('tbl_transaksi_sampah')
            ->selectSum('jumlah')
            ->where('jenis', '2')
            ->where('nasabah_id', $nasabah_id)
            ->get()
            ->getRowArray();