app/Models/ModelMutasi.php

SELECT *
FROM `tbl_mutasi`
LEFT JOIN `tbl_nasabah` ON `tbl_nasabah`.`id_nasabah` = `tbl_mutasi`.`nasabah_id`
ORDER BY `id_mutasi` ASC
---
    public function getAllData()
    {
        return $this->db->table('tbl_mutasi')
            ->join('tbl_nasabah', 'tbl_nasabah.id_nasabah = tbl_mutasi.nasabah_id ', 'left')
            ->orderBy('id_mutasi', 'ASC')
            ->get()
            ->getResultArray();

INSERT INTO `tbl_mutasi` (`nasabah_id`, `jenis`, `jumlah`, `created_at`) VALUES ('2', '1', '535353', '2023-09-01 08:55:09')
---
    public function insertData($data)
    {
        $this->db->table('tbl_mutasi')
            ->insert($data);

SELECT *
FROM `tbl_mutasi`
LEFT JOIN `tbl_nasabah` ON `tbl_nasabah`.`id_nasabah` = `tbl_mutasi`.`nasabah_id`
WHERE `nasabah_id` = '2'
---
    public function detailData($nasabah_id)
    {
        return $this->db->table('tbl_mutasi')
            ->join('tbl_nasabah', 'tbl_nasabah.id_nasabah = tbl_mutasi.nasabah_id ', 'left')
            ->where('nasabah_id', $nasabah_id)
            ->get()
            ->getResultArray();

SELECT SUM(`jumlah`) AS `jumlah`
FROM `tbl_mutasi`
WHERE `jenis` = '1'
AND `nasabah_id` = '2'
---
    public function totalDebit($nasabah_id)
    {
        return $this->db->table('tbl_mutasi')
            ->selectSum('jumlah')
            ->where('jenis', '1')
            ->where('nasabah_id', $nasabah_id)
            ->get()
            ->getRowArray();

SELECT SUM(`jumlah`) AS `jumlah`
FROM `tbl_mutasi`
WHERE `jenis` = '2'
AND `nasabah_id` = '2'
---
    public function totalKredit($nasabah_id)
    {
        return $this->db->table('tbl_mutasi')
            ->selectSum('jumlah')
            ->where('jenis', '2')
            ->where('nasabah_id', $nasabah_id)
            ->get()
            ->getRowArray();