app/Models/ModelNasabah.php

SELECT *
FROM `tbl_nasabah`
LEFT JOIN `tbl_level` ON `tbl_level`.`id_level` = `tbl_nasabah`.`id_level`
ORDER BY `id_nasabah` ASC
---
    public function getAllData()
    {
        return $this->db->table('tbl_nasabah')
            ->join('tbl_level', 'tbl_level.id_level = tbl_nasabah.id_level ', 'left')
            ->join('tbl_agama', 'tbl_agama.id_agama = tbl_nasabah.id_agama ', 'left')
            ->orderBy('id_nasabah', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_nasabah`
WHERE `id_nasabah` = '2'
---
    public function detailData($id_nasabah)
    {
        return $this->db->table('tbl_nasabah')
            ->where('id_nasabah', $id_nasabah)
            ->get()
            ->getRowArray();