app/Models/ModelJenisSampah.php

SELECT *
FROM `tbl_jenis_sampah`
ORDER BY `id_jenis_sampah` ASC
---
    public function getAllData()
    {
        return $this->db->table('tbl_jenis_sampah')
            ->orderBy('id_jenis_sampah', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_jenis_sampah`
WHERE `id_jenis_sampah` = '2'
---
    public function detailData($id_jenis_sampah)
    {
        return $this->db->table('tbl_jenis_sampah')
            ->where('id_jenis_sampah', $id_jenis_sampah)
            ->get()
            ->getResultArray();