app/Models/ModelAuth.php

    public function login_admin($username, $password)
    {
        return $this->db->table('tbl_user')
            ->where([
                'username' => $username,
                'password' => $password,
            ])
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'admin'
AND `password` = 'admin'

    public function login_nasabah($username_nasabah, $password_nasabah)
    {
        return $this->db->table('tbl_nasabah')
            ->where([
                'username_nasabah' => $username_nasabah,
                'password_nasabah' => $password_nasabah,
            ])
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_nasabah`
WHERE `username_nasabah` = 'admin'
AND `password_nasabah` = 'admin'